#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitClearResult(void);
void UninitClearResult(void);
void UpdateClearResult(void);
void DrawClearResult(void);
