#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGameOverResult(void);
void UninitGameOverResult(void);
void UpdateGameOverResult(void);
void DrawGameOverResult(void);
