/*==============================================================================

   ゲーム内時間管理処理 [timemanager.h]
														 Author : 横田郁弥
														 Date   : 2022/12/10 14:35
--------------------------------------------------------------------------------
  ゲーム内時間を記録できる時間管理クラスを作成
  好きなように時間を動かせるようにする
  Updateにシーン遷移の条件
==============================================================================*/
#pragma once
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
class TimeManager
{
public:
	float		time;
	float		nowTime;
	float		frame;
};

#define	TIME_LIMIT	10	//制限時間

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTimeManager(void);
void UninitTimeManager(void);
void UpdateTimeManager(void);
void DrawTimeManager(void);

